// 🗣️ Common Bangla Messages
export const msgs = {
  minReg20: "কমপক্ষে ২০ (বিশ) জন শিক্ষার্থী থাকতে হবে",
  minReg25: "কমপক্ষে ২৫ (পঁচিশ) জন শিক্ষার্থী থাকতে হবে",
  minReg30: "কমপক্ষে ৩০ (ত্রিশ) জন শিক্ষার্থী থাকতে হবে",
  minReg35: "কমপক্ষে ৩৫ (পঁয়ত্রিশ) জন শিক্ষার্থী থাকতে হবে",
  minReg40: "কমপক্ষে ৪০ (চল্লিশ) জন শিক্ষার্থী থাকতে হবে",
  minReg45: "কমপক্ষে ৪৫ (পঁয়তাল্লিশ) জন শিক্ষার্থী থাকতে হবে",

  minPas40: "পাশের হার কমপক্ষে ৪০% থাকতে হবে",
  minPas45: "পাশের হার কমপক্ষে ৪৫% থাকতে হবে",
  minPas50: "পাশের হার কমপক্ষে ৫০% থাকতে হবে",
  minPas55: "পাশের হার কমপক্ষে ৫৫% থাকতে হবে",
  minPas60: "পাশের হার কমপক্ষে ৬০% থাকতে হবে",
};

// Total Students Validation
export const checkMinTotal = (value, min) => {
  return (value && value < min ? msgs[`minReg${min}`] : "");
};

// Pass Rate Validation
export const checkPassRate = (passed, appeared, rate) => {
  if (!passed || !appeared) return "";

  if (passed > appeared) {
    return "অংশগ্রহণকারী পরীক্ষার্থীর থেকে পাশকৃত পরীক্ষার্থীর সংখ্যা বেশী হতে পারবে না।";
  }

  if (passed < (appeared * rate) / 100) {
    return msgs[`minPas${rate}`] || "";
  }

  return "";
};
